# DBeam_Get2DLines

## Description
Return the most recently created beam object

```pascal
FUNCTION DBeam_Get2DLines : HANDLE;
```

```python

def vs.DBeam_Get2DLines():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight